* TODO TIC TAC TOE game
The exercise involves developing a Tic-Tac-Toe game strictly adhering to the TDD rules.
** DONE 1 – Game Board Creation phase
   - State "DONE"       from "TODO"       [2021-03-29 Mon 16:59]
*** DONE describe board
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 16:59]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 16:46]
** TODO describe winning scenarios
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:01]--[2021-03-29 Mon 17:04] =>  0:03
   :END:
** IN-PROGRESS describe board operations
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:14]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:04]--[2021-03-29 Mon 17:11] =>  0:07
   :END:
*** DONE occupy 0 row and 0 collumn by player X
    - State "DONE"       from "TODO"       [2021-03-29 Mon 18:01]
    :LOGBOOK:
    CLOCK: [2021-03-29 Mon 17:58]--[2021-03-29 Mon 18:01] =>  0:03
    CLOCK: [2021-03-29 Mon 17:32]--[2021-03-29 Mon 17:41] =>  0:09
    CLOCK: [2021-03-29 Mon 17:16]--[2021-03-29 Mon 17:27] =>  0:11
    :END:
*** IN-PROGRESS retrieve board row by index offset
    :LOGBOOK:
    CLOCK: [2021-03-29 Mon 18:14]
    :END:


    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:14]
* Tech debt
** DONE extract board offset  calculation
   - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 17:32]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:27]--[2021-03-29 Mon 17:32] =>  0:05
   :END:
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 17:27]
** IN-PROGRESS complicated won logic refactor!
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:01]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 18:01]--[2021-03-29 Mon 18:14] =>  0:13
   :END:
** TODO define function is-empty to test for board cell emptines
** TODO  we most probably do not need board offset (examine and refactor)
